Day5/laminar_pipe/case0-igor/constant/PaxHeaders.8021/transportProperties
30 mtime=1560320002.346251525
29 atime=1565109432.08423007
30 ctime=1565108412.198146955
