Day5/laminar_pipe/case0-igor/system/PaxHeaders.8021/controlDict
30 mtime=1560320002.302252093
30 atime=1565109315.675963954
30 ctime=1565108412.198146955
