Day5/laminar_pipe/case0-igor/system/PaxHeaders.8021/decomposeParDict
30 mtime=1560320002.278252402
30 atime=1565109315.675963954
30 ctime=1565108412.198146955
