Day5/laminar_pipe/case0-igor/system/PaxHeaders.8021/sampleDict
30 mtime=1565109789.228755048
30 atime=1565109793.244759649
30 ctime=1565109789.240755061
